source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/VoltaRedondaRJ.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
  <Servicos ID="NFSe">
    <RecepcionarLoteRps versao="2.03">
      <Descricao>Recepcionar Lote RPS</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/RecepcionarLoteRps</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/RecepcionarLoteRps</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:RecepcionarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:RecepcionarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </RecepcionarLoteRps>
    <GerarNfse versao="2.03">
      <Descricao>Gerar Nota Fiscal de Serviço</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/GerarNfse</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/GerarNfse</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:GerarNfseRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:GerarNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </GerarNfse>
    <SubstituirNfse versao="2.03">
      <Descricao>Substituir nota fiscal de Serviço</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/SubstituirNfse</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/SubstituirNfse</WebActionProducao>
      <TagExtraAssinatura>SubstituirNfseEnvio</TagExtraAssinatura>
      <TagExtraAtributoID>SubstituicaoNfse</TagExtraAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:SubstituirNfseRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:SubstituirNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </SubstituirNfse>
    <ConsultarLoteRps versao="2.03">
      <Descricao>Consulta lote RPS</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/ConsultarLoteRps</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/ConsultarLoteRps</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:ConsultarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:ConsultarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarLoteRps>
    <ConsultarNfsePorRps versao="2.03">
      <Descricao>Consulta NFSe por RPS</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseRps</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseRps</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:ConsultarNfseRpsRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfseRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarNfsePorRps>
    <ConsultarNfseServicoPrestado versao="2.03">
      <Descricao>Consulta NFSe de serviços prestados</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseServicoPrestado</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseServicoPrestado</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:ConsultarNfseServicoPrestadoRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfseServicoPrestadoRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarNfseServicoPrestado>
    <ConsultarNfseServicoTomado versao="2.03">
      <Descricao>Consulta NFSe de serviços tomados</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseServicoTomado</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseServicoTomado</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:ConsultarNfseServicoTomadoRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfseServicoTomadoRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarNfseServicoTomado>
    <ConsultarNfseFaixa versao="2.03">
      <Descricao>Consulta NFSe por Faixa</Descricao>
      <WebEnderecoHomologacao>https://wshomologacaoabrasf1.simplissweb.com.br/nfseservice.svc</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://wsvoltaredonda.simplissweb.com.br/nfseservice.svc</WebEnderecoProducao>
      <WebActionHomologacao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseFaixa</WebActionHomologacao>
      <WebActionProducao>http://nfse.abrasf.org.br/INfseService/ConsultarNfseFaixa</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soap:Body><nfse:ConsultarNfseFaixaRequest><nfseCabecMsg><![CDATA[<cabecalho versao="2.03" xmlns="http://www.abrasf.org.br/nfse.xsd"><versaoDados>2.03</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></nfse:ConsultarNfseFaixaRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.03</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarNfseFaixa>
	  <GerarNfse versao="1.01">
		  <Descricao>Envio do DPS - Sincrono</Descricao>
		  <RequestURIProducao>https://nfsevoltaredonda.simplissweb.com.br/nfse</RequestURIProducao>
		  <RequestURIHomologacao>https://producaorestrita.simplissweb.com.br/nfse</RequestURIHomologacao>
		  <MetodoAPI>post</MetodoAPI>
		  <WebActionProducao>dpsXmlGZipB64</WebActionProducao>
		  <WebSoapString></WebSoapString>
		  <WebContentType>application/json</WebContentType>
		  <WebTagRetorno>nfseXmlGZipB64</WebTagRetorno>
		  <TargetNS>http://www.sped.fazenda.gov.br/nfse</TargetNS>
		  <SchemaVersao>1.01</SchemaVersao>
		  <GZIPCompress>true</GZIPCompress>
		  <LoginConexao>false</LoginConexao>
		  <UsaCertificadoDigital>true</UsaCertificadoDigital>
	  </GerarNfse>
	  <CancelarNfse versao="1.01">
		  <Descricao>Envio do cancelamento de NFSe</Descricao>
		  <RequestURIProducao>https://nfsevoltaredonda.simplissweb.com.br/nfse/{Chave}/eventos</RequestURIProducao>
		  <RequestURIHomologacao>https://producaorestrita.simplissweb.com.br/nfse/{Chave}/eventos</RequestURIHomologacao>
		  <MetodoAPI>post</MetodoAPI>
		  <WebActionProducao>pedidoRegistroEventoXmlGZipB64</WebActionProducao>
		  <WebSoapString></WebSoapString>
		  <WebContentType>application/json</WebContentType>
		  <WebTagRetorno>eventoXmlGZipB64</WebTagRetorno>
		  <SchemaVersao>1.01</SchemaVersao>
		  <GZIPCompress>true</GZIPCompress>
		  <LoginConexao>false</LoginConexao>
		  <UsaCertificadoDigital>true</UsaCertificadoDigital>
	  </CancelarNfse>
	  <ConsultarNfse versao="1.01">
		  <Descricao>Consultar NFSe</Descricao>
		  <RequestURIProducao>https://nfsevoltaredonda.simplissweb.com.br/nfse/{Chave}</RequestURIProducao>
		  <RequestURIHomologacao>https://producaorestrita.simplissweb.com.br/nfse/{Chave}</RequestURIHomologacao>
		  <MetodoAPI>get</MetodoAPI>
		  <WebActionProducao></WebActionProducao>
		  <WebSoapString></WebSoapString>
		  <WebContentType>application/json</WebContentType>
		  <WebTagRetorno>nfseXmlGZipB64</WebTagRetorno>
		  <SchemaVersao></SchemaVersao>
		  <GZIPCompress>false</GZIPCompress>
		  <LoginConexao>false</LoginConexao>
		  <UsaCertificadoDigital>true</UsaCertificadoDigital>
	  </ConsultarNfse>
  </Servicos>
</Configuracoes>