ReInf/Nfse/Templates/JoaoPessoa/ConsultarLoteRps.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://nfse.abrasf.org.br"><soapenv:Header/><soapenv:Body><ws:ConsultarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"><versaoDados>1.00</versaoDados></cabecalho>]]></nfseCabecMsg><nfseDadosMsg><![CDATA[<ConsultarLoteRpsEnvio xmlns="http://www.abrasf.org.br/nfse.xsd">%s<Protocolo>%s</Protocolo></ConsultarLoteRpsEnvio>]]></nfseDadosMsg></ws:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>