Modulos/TecnoSpeed/NFSe/Arquivos/Templates/iiBrasil/ConsultarNfsePorRps.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br">
   <soapenv:Header/>
   <soapenv:Body>
      <nfse:ConsultarNfsePorRpsRequest>
         <nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.04"><versaoDados>2.04</versaoDados></cabecalho>]]>
         </nfseCabecMsg>
         <nfseDadosMsg>
         <![CDATA[%s]]>
         </nfseDadosMsg>
      </nfse:ConsultarNfsePorRpsRequest>
   </soapenv:Body>
</soapenv:Envelope>